14.1.
В таблице Invoices, в отличие от Orders, добавлены названия компаний покупателей,
 их адреса (города, регионы, индексы, страны)? имена сотрудников, название поставщиков,
 ID товаров в заказе, название товаров, цена товаров, количество товара, цена товаров с учетом скидки
 .Т.е данная таблица боолее детально описывает информацию о заказах с добавлением удобных, для 
 понимания деталей заказов полей.
 
 14.2.
 "CategorySales for 1997" выдает информацию о прибыли с товаров по каждой категории товаров,
 которую собирает из представления "Product Sales for 1997".
 
 14.3.
 "Sales Total by Amount" выдает поле с информацией о заказах которых было продано на сумму свыше 2500,
 с ID по данному заказу, названием покупателя и датой доставки заказа.
 
 14.4
 "Products Above Average Price" выдает имя продуков и цены на продукты цена которых,
 выше средней цены на данный конкретный продукт
 
 14.5
 "Summary of Sales by Quarter" выдает информацию о поставке - дату, ID поставки и общую сумму денег
 с ксетом скидок по данному заказу.